<template>
  <div>
    <div>
      <div class="join-wr">
        <div class="step2-top">
          <el-checkbox v-model="form.terms1">서비스 이용약관 (필수)
            <el-button type="text" @click="handleShowTerms('show1')">내용보기</el-button></el-checkbox>
          <div class="guide" v-show="termsShow.show1">
            <p class="tab_cont_tit mb_tit">
              <span class="fw_b">서비스 이용약관</span><br>
            </p>
            <ul class="tab_cont_list">
              <li>
                <p class="tab_cont_tit">
                  제 1장 총칙
                  <br><br>제 1 조 (목적)
                  <br>이 이용약관은 “뛰장 (이하 "당 사이트")”에서 제공하는 인터넷 서비스(이하 '서비스')의 가입조건, 당 사이트와 이용자의 권리, 의무, 책임사항과 기타 필요한 사항을
                  규정함을 목적으로 합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 2 조 (용어의 정의)
                  <br>1. "이용자"라 함은 당 사이트에 접속하여 이 약관에 따라 당 사이트가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
                  <br>2. "회원"이라 함은 서비스를 이용하기 위하여 당 사이트에 개인정보를 제공하여 아이디(ID)와 비밀번호를 부여 받은 자를 말합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 3 조 (이용약관의 효력 및 변경)
                  <br>1. 당 사이트는 이 약관의 내용을 회원이 알 수 있도록 당 사이트의 초기 서비스화면에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.
                  <br>2. 당 사이트는 이 약관을 개정할 경우에 적용일자 및 개정사유를 명시하여 현행 약관과 함께 당 사이트의 초기화면 또는 초기화면과의 연결화면에 그 적용일자 7일 이전부터 적용일자
                  전일까지 공지합니다. 다만, 회원에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 당 사이트는 개정 전 내용과 개정 후 내용을
                  명확하게 비교하여 이용자가 알기 쉽도록 표시합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 4 조(약관 외 준칙)
                  <br>1. 이 약관은 당 사이트가 제공하는 서비스에 관한 이용안내와 함께 적용됩니다.
                  <br>2. 이 약관에 명시되지 아니한 사항은 관계법령의 규정이 적용됩니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 2 장 이용계약의 체결
                  <br><br>제 5 조 (이용계약의 성립 등)
                  <br>이용계약은 이용고객이 당 사이트가 정한 약관에 「동의합니다」를 선택하고, 당 사이트가 정한 회원가입양식을 작성하여 서비스 이용을 신청한 후, 당 사이트가 이를 승낙함으로써
                  성립합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 6 조 (회원가입)
                  <br>서비스를 이용하고자 하는 고객은 당 사이트에서 정한 회원가입양식에 개인정보를 기재하여 가입을 하여야 합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 7 조 (개인정보의 보호 및 사용)
                  <br>당 사이트는 관계법령이 정하는 바에 따라 회원 등록정보를 포함한 회원의 개인정보를 보호하기 위해 노력합니다. 회원 개인정보의 보호 및 사용에 대해서는 관련법령 및 당 사이트의
                  개인정보 보호정책이 적용됩니다. 다만, 당 사이트 이외에 링크된 사이트에서는 당 사이트의 개인정보 보호정책이 적용되지 않습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 8 조 (이용 신청의 승낙과 제한)
                  <br>1. 당 사이트는 제6조의 규정에 의한 이용신청고객에 대하여 약관에 정하는 바에 따라 서비스 이용을 승낙합니다.
                  <br>2. 당 사이트는 아래사항에 해당하는 경우에 대해서 회원가입을 승낙하지 아니하거나 이후 사전 통보 없이 취소할 수 있습니다.
                  <br>- 회원가입 신청 시 내용을 허위로 기재한 경우
                  <br>- 기타 규정한 제반사항을 위반하며 신청하는 경우
                  <br>- 다른 사람의 당 사이트 이용을 방해하거나 그 정보를 도용하는 등의 행위를 하였을 경우
                  <br>- 당 사이트를 이용하여 법령과 본 약관이 금지하는 행위를 하는 경우
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 3 장 계약 당사자의 의무
                  <br><br>제 9 조 ("뛰장"의 의무)
                  <br>1. 당 사이트는 이용고객이 희망한 서비스 제공 개시일에 특별한 사정이 없는 한 서비스를 이용할 수 있도록 하여야 합니다.
                  <br>2. 당 사이트는 개인정보 보호를 위해 보안시스템을 구축하며 개인정보 보호정책을 공시하고 준수합니다.
                  <br>3. 당 사이트는 회원으로부터 제기되는 의견이 합당하다고 판단될 경우에는, 적절한 조치를 취하여야 합니다.
                  <br>4. 당 사이트는 전시, 사변, 천재지변, 비상사태, 현재의 기술로는 해결이 불가능한 기술적 결함 기타 불가항력적 사유 및 이용자의 귀책사유로 인하여 발생한 이용자의 손해, 손실,
                  기타 모든 불이익에 대하여 어떠한 책임도 지지 않습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 10 조 (회원의 의무)
                  <br>1. 이용자는 회원가입 신청 또는 회원정보 변경 시 실명으로 모든 사항을 사실에 근거하여 작성하여야 하며, 허위 또는 타인의 정보를 등록할 경우 일체의 권리를 주장할 수 없습니다.
                  <br>2. 당 사이트가 관계법령 및 개인정보 보호정책에 의거하여 그 책임을 지는 경우를 제외하고, 회원에게 부여된 아이디의 비밀번호 관리소홀, 부정사용 등에 의하여 발생하는 모든 결과에
                  대한 책임은 회원에게 있습니다.
                  <br>3. 회원은 당 사이트 및 제 3자의 지식재산권을 침해해서는 안 됩니다.
                  <br>4. 이용자는 당 사이트의 운영자, 직원, 기타 관계자를 사칭하는 행위를 하여서는 안 됩니다.
                  <br>5. 이용자는 바이러스, 악성코드 등을 제작, 배포, 이용하여서는 아니 되고, 당 사이트의 승인 없이 광고하는 행위를 하여서는 안 됩니다.
                  <br>6. 이용자는 당 사이트 및 제 3자의 명예를 훼손하거나 업무를 방해하거나, 외설적이거나, 폭력적이거나 기타 공서양속에 반하는 게시물, 쪽지, 메일 등을 게시, 전송, 배포하여서는
                  안 됩니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 4 장 서비스의 이용
                  <br><br>제 11 조 (서비스 이용 시간)
                  <br>1. 회원의 이용신청을 승낙한 때부터 서비스를 개시합니다. 단, 일부 서비스의 경우에는 지정된 일자부터 서비스를 개시합니다.
                  <br>2. 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지 못하는 경우에는 사이트에 공시하거나 회원에게 이를 통지합니다.
                  <br>3. 서비스의 이용은 연중무휴, 1일 24시간을 원칙으로 하며, 서비스 응대 및 처리 시간은 법정 근무일 근무시간(09:00~18:00, 법정공휴일 및 주말 제외)으로 합니다.
                  다만, 당 사이트의 업무상 또는 기술상의 이유로 서비스가 일시 중지 될 수 있습니다. 이러한 경우 당 사이트는 사전 또는 사후에 이를 공지합니다.
                  <br>4. 회원으로 가입한 이후라도 일부 서비스 이용 시 서비스 제공자의 요구에 따라 특정회원에게만 서비스를 제공할 수 있습니다.
                  <br>5. 서비스를 일정범위로 분할하여 각 범위별로 이용가능 시간을 별도로 정할 수 있습니다. 이 경우 그 내용을 사전에 공개합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 12 조 (홈페이지 저작권)
                  <br>1. 당 사이트가 게시한 본 홈페이지의 모든 콘텐트에 대한 저작권은 당 사이트에 있습니다. 다만, 게시물의 원저작자가 별도로 있는 경우 그 출처를 명시하며 해당 게시물의 저작권은
                  원저작자에게 있습니다.
                  <br>2. 회원이 직접 게시한 저작물의 저작권은 회원에게 있습니다. 다만, 회원은 당 사이트에 무료로 이용할 수 있는 권리를 허락한 것으로 봅니다.
                  <br>3. 당 사이트 소유의 콘텐트에 대하여 제3자가 허락 없이 다른 홈페이지에 사용 또는 인용하는 것을 금지합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 13 조 (서비스의 변경, 중단)
                  <br>1. 당 사이트는 기술상•운영상의 필요에 의해 제공하는 서비스의 일부 또는 전부를 변경하거나 중단할 수 있습니다. 당 사이트의 서비스를 중단하는 경우에는 30일 전에 홈페이지에
                  이를 공지하되, 다만 사전에 통지할 수 없는 부득이한 사정이 있는 경우는 사후에 통지를 할 수 있습니다.
                  <br>2. 제1항의 경우에 당 사이트가 제공하는 서비스의 이용과 관련하여, 당 사이트는 이용자에게 발생한 어떠한 손해에 대해서도 책임을 지지 않습니다. 다만 당 사이트의 고의 또는
                  중대한 과실로 인하여 발생한 손해의 경우는 제외합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 5 장 계약 해지 및 이용 제한
                  <br><br>제 14 조 (계약 해지)
                  <br>1. 회원은 언제든지 마이페이지 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며, 당 사이트는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
                  <br>2. 회원이 계약을 해지할 경우, 관련법령 및 개인정보처리방침에 따라 당 사이트가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 회원의 모든 데이터는 소멸됩니다.
                  <br>3. 회원이 계약을 해지하는 경우, 즉시 회원이 작성한 게시물(공용게시판에 등록된 게시물 등)은 삭제됩니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 15 조 (서비스 이용제한)
                  <br>1. 당 사이트는 회원이 서비스 이용에 있어서 본 약관 및 관련 법령을 위반하거나, 다음 각 호에 해당하는 경우 서비스 이용을 제한할 수 있습니다.
                  <br>- 2년 이상 서비스를 이용한 적이 없는 경우
                  <br>- 기타 정상적인 서비스 운영에 방해가 될 경우
                  <br>2. 상기 이용제한 규정에 따라 서비스를 이용하는 회원에게 사전 통지 후 서비스 이용을 일시정지 등 제한하거나 이용계약을 해지 할 수 있습니다. 단, 불가피한 사유로 사전 통지가
                  불가능한 경우에는 그러하지 아니합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 6 장 손해배상 및 기타사항
                  <br><br>제 17 조 (손해배상)
                  <br>당 사이트는 무료로 제공되는 서비스와 관련하여 회원에게 어떠한 손해가 발생하더라도 당 사이트가 고의 또는 과실로 인한 손해발생을 제외하고는 이에 대하여 책임을 부담하지 아니합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 18 조 (관할 법원)
                  <br>서비스 이용으로 발생한 분쟁에 대해 소송이 제기되는 경우 민사 소송법상의 관할 법원에 제기합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 19 조 (서비스별 이용자 사전 동의 사항과 의무)
                  <br>당 사이트에 ‘기술정보를 제공하는 이용자는 자신의 기술정보에 대한 권리(특허권, 실용신안권, 디자인권, 상표권 등)를 법적으로 보호받기 위해서 필요한 조치를 스스로 취하여야
                  합니다. 당 사이트는 이용자의 권리 보장이나 취득 등을 위한 어떠한 명목의 의무나 책임도 부담하지 않고, 이를 보장하지 않으며, 이용자 개인의 행위(당 사이트의 서비스 이용 행위 일체를
                  포함)로 인한 어떠한 분쟁이나 어떠한 명목의 손실, 손해에 대해서도 법적 책임을 지지 아니합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 7 장 " 뛰장" 게시물 운영정책
                  <br><br>제 20 조 (운영정책)
                  <br>"뛰장" 각종 게시물에 대한 운영정책은 방송통신심의위원회의 정보통신에 관한 심의규정에 기반하며 이를 위반할 경우, "뛰장" 운영정책에 의해 관련 게시물은 예고 없이 삭제,
                  이동될 수 있으며, 게시자(회원)는 아이디 이용제한 등 "뛰장" 이용에 제한을 받을 수 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 21 조 (게시물 등록)
                  <br>게시물은 실명을 통해 등록합니다. 악성 글 등을 업로드 하실 경우 게시물 삭제 또는 게시자(회원)의 이용제한 등의 경고 조치가 가능합니다.
                  <br>1. 주민등록번호 도용 타인의 개인정보를 이용한 활동이 발견될 경우, 해당 회원은 이용에 제한을 받을 수 있으며, 해당 계정은 본인인증 후에 정상적인 이용이 가능합니다. 또한 여러
                  개의 아이디를 생성하여 허위신고를 하거나, 타인 사칭을 통한 문제 발생 시, 그에 따른 이용 제한을 받을 수 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 22 조 (게시물의 저작권)
                  <br>1. 게시물은 회원이 서비스를 이용하면서 게재한 글, 사진, 파일, 관련 링크 및 댓글 등을 말합니다.
                  <br>2. 회원이 서비스에 등록하는 게시물로 인하여 본인 또는 타인에게 손해 및 기타 문제가 발생하는 경우, 회원은 이에 대한 책임을 질수 있으며 또한 명예훼손이나 개인정보 유출,
                  저작권과 같은 법률에 위배되는 게시물 및 댓글은 관련 법안에 따라 민형사상 처벌을 받을 수 있으니 이 점 유의하여 주시기 바랍니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 23 조 (게시물 제한규정(삭제 및 이동)
                  <br>1. 욕설/비속어 및 분란을 조장하는 게시물
                  <br>- 욕설 및 비속어가 담겨있거나, 연상시키는 내용
                  <br>- 이유 없이 회원 간의 분란을 발생시킬 여지가 있는 내용의 게시물 또는 댓글
                  <br>2. 게시판 및 자료실과 관련 없는 게시물
                  <br>- 각 주제 분야별로 나뉘어 있는 게시판 및 자료실의 주제와 관련 없는 내용
                  <br>3. 상업성 광고 및 홍보 글에 관한 게시물
                  <br>4. 개인정보의 유포에 관한 게시물
                  <br>- 타인, 혹은 본인의 메일주소/실명/사진/전화번호/주민등록번호 등의 개인정보 또는 해당 정보가 담겨 있는 내용
                  <br>5. 확인되지 않은 소문의 유포에 관한 게시물
                  <br>- 공개되었을 경우, 당사자의 권리침해가 우려되는 내용
                  <br>6. 정치적 견해 차이 및 인종/성별/지역/종교에 대한 차별, 비하하는 게시물
                  <br>- 인종/성별/지역/종교에 대한 차별적 발언 또는 비하하는 내용
                  <br>- 상이한 정치적 견해를 비하하거나 폄하하는 내용
                  <br>7. 타인을 사칭하거나 범죄행위에 관한 게시물
                  <br>- 공인이나 특정이슈와 관련한 당사자 또는 지인, 주변인 등을 사칭하여 게시물을 작성하거나, "뛰장" 운영자를 사칭하여 작성된 내용
                  <br>- 범죄와 관련 있거나 범죄를 유도하는 행위를 포함하는 내용
                  <br>8. 저작권 위반에 관한 게시물
                  <br>- 기사, 사진, 동영상, 음원, 영상물 등 저작권에 의해 보호받는 콘텐츠와 관련된 내용 뉴스의 경우, 기사 내용의 전부 혹은 일부를 게시하는 경우에는 저작권에 저촉될 수 있기
                  때문에 링크(URL)만을 허용합니다.
                  <br>- 음원, 사진, 동영상 등 해당 자료에 대한 불법공유를 목적으로 작성한 내용 공유를 목적으로 이메일을 수집하는 행위도 동일하게 처리됩니다.
                  <br>9. 악성코드/스파이웨어/혐오감 조성에 관한 게시물
                  <br>- 악성코드 및 스파이웨어의 유포 및 유도 관련 게시물은 사전경고 없이 제재를 받을 수 있습니다.
                  <br>- 시각 및 청각적으로 타인에게 혐오감을 줄 수 있는 게시물은 사전경고 없이 제재를 받을 수 있습니다.
                  <br>10. 기타 서비스 운영에 지장을 초래할 수 있는 게시물
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 24 조 (이용제한)
                  <br>1. 게시물 제한규정(3조)에 해당하는 내용을 게재하는 경우
                  <br>2. 다량의 게시물 등록을 목적으로 의미 없는 제목을 사용하거나, 반복되는 제목을 사용하여 게재하는 경우
                  <br>3. 비정상적인 방법으로 게시물을 등록, 조회 및 추천하는 경우 등
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제 25 조 (게시중단 요청 서비스)
                  <br>다른 회원의 게시물로 인하여 명예훼손, 저작권 침해 등의 피해를 입었을 경우, 운영담당자를 통해 해당 게시물에 대한 게시중단을 요청하실 수 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  [부 칙]
                  <br>(시행일) 이 약관은 2023년 07월 13일부터 적용되며, 종전 약관은 본 약관으로 대체되며, 개정된 약관의 적용일 이전 가입자도 개정된 약관의 적용을 받습니다.
                </p>
              </li>
            </ul>
          </div>
          <el-checkbox v-model="form.terms2">개인정보처리방침 (필수)
            <el-button type="text" @click="handleShowTerms('show2')">내용보기</el-button></el-checkbox>
          <div class="guide" v-show="termsShow.show2">
            <p class="tab_cont_tit mb_tit">
              <span class="fw_b">개인정보처리방침</span><br>
              뛰장 ('https://ttwijang.co.kr/'이하 '뛰장 ')은(는) 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게
              처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.
            </p>
            <ul class="tab_cont_list">
              <li>
                <p class="tab_cont_tit">
                  뛰장 은(는) 회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  ○ 본 방침은부터 2023년 6월 1일부터 시행됩니다.
                  <br><br>1. 개인정보의 처리 목적
                  뛰장 ('https://ttwijang.co.kr/'이하 '뛰장 ')은(는) 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며
                  이용 목적이 변경될 시에는 사전동의를 구할 예정입니다.
                  <br><br>가. 홈페이지 회원가입 및 관리
                  <br>회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종 고지·통지 등을 목적으로 개인정보를 처리합니다.
                  <br><br>2. 개인정보 파일 현황
                  <br>개인정보 파일명 : 뛰장 개인정보
                  <br>- 개인정보 항목 : 이메일, 휴대전화번호, 생년월일, 이름, 성별, 주소
                  <br>- 수집방법 : 홈페이지
                  <br>- 보유근거 : 홈페이지 서비스 이용
                  <br>- 보유기간 : 지체없이 파기
                  <br>- 관련법령 :
                  <br><br>3. 개인정보의 처리 및 보유 기간
                  <br>① 뛰장 은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유,이용기간 내에서 개인정보를 처리,보유합니다.
                  <br>② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  홈페이지 회원가입 및 관리
                  <br>홈페이지 회원가입 및 관리와 관련한 개인정보는 수집.이용에 관한 동의일로부터지체없이 파기까지 위 이용목적을 위하여 보유.이용됩니다.
                  <br>- 보유근거 : 홈페이지 서비스 이용
                  <br>- 관련법령 :
                  <br>- 예외사유 :
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  4. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.
                  <br>① 정보주체는 뛰장 에 대해 언제든지 개인정보 열람,정정,삭제,처리정지 요구 등의 권리를 행사할 수 있습니다.
                  <br>② 제1항에 따른 권리 행사는 뛰장 에 대해 개인정보 보호법 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 뛰장 이에 대해
                  지체 없이 조치하겠습니다.
                  <br>③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을
                  제출하셔야 합니다.
                  <br>④ 개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.
                  <br>⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.
                  <br>⑥ 뛰장 은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  5. 처리하는 개인정보의 항목 작성
                  ① 뛰장 ('https://ttwijang.co.kr/'이하 '뛰장 ')은(는) 다음의 개인정보 항목을 처리하고 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  홈페이지 회원가입 및 관리
                  <br> - 필수항목 : 이메일, 생년월일, 이름, 성별, 전화번호
                  <br> - 선택항목 : 자택주소
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  6. 개인정보의 파기 뛰장 은(는) 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.
                  <br>- 파기절차
                  이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로
                  옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.
                  <br>- 파기기한
                  이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게
                  되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내
                  에 그 개인정보를 파기합니다.
                  <br>- 파기방법
                  전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  7. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항
                  뛰장 은 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키’를 사용하지 않습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  8. 개인정보 보호책임자 작성
                  ① 뛰장 (‘https://ttwijang.co.kr/’이하 ‘뛰장 ) 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및
                  피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
                  <br>▶ 개인정보 보호책임자
                  <br>성명 : 오형래
                  <br>직책 : 대표
                  <br>연락처 : 010-4047-0017
                  <br>※ 개인정보 보호 담당부서로 연결됩니다.
                  <br>② 정보주체께서는 뛰장 (‘https://ttwijang.co.kr/’이하 ‘뛰장 ) 의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리,
                  피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 뛰장 (‘https://ttwijang.co.kr/’이하 ‘뛰장) 은(는) 정보주체의 문의에
                  대해 지체 없이 답변 및 처리해드릴 것입니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  9. 개인정보 처리방침 변경
                  ①이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  10. 개인정보의 안전성 확보 조치 뛰장 은(는) 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  <br>1. 정기적인 자체 감사 실시
                  개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.
                  <br>2. 개인정보 취급 직원의 최소화 및 교육
                  개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고 있습니다.
                  <br>3. 내부관리계획의 수립 및 시행
                  개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.
                  <br>4. 개인정보의 암호화
                  이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도
                  보안기능을 사용하고 있습니다.
                  <br>5. 개인정보에 대한 접근 제한
                  개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단
                  접근을 통제하고 있습니다.
                </p>
              </li>
            </ul>
          </div>
          <!-- <textarea class="nft" v-show="termsShow.show2" v-model="terms2" /> -->
          <el-checkbox v-model="form.terms3">개인민감정보 처리방침 (필수)
            <el-button type="text" @click="handleShowTerms('show3')">내용보기</el-button></el-checkbox>
          <div class="guide" v-show="termsShow.show3">
            <p class="tab_cont_tit mb_tit">
              <span class="fw_b">개인민감정보처리방침</span><br>
              뛰장 (이하 “회사”)은 개인 민감정보보호법 제23조(민감정보 처리제한), 동법 시행령 제 18조(민감정보 범위), 표준지침 제15조 (민감정보처리), 민감정보 정의, 종류, 동의사항 등
              정보통신서비스제공자가 준수하여야 할 관련 법령상의 민감정보 처리제한 규정을 준수하며, 관련 법령에 의거한 개인민감정보취급방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다. 본 개인
              민감정보처리방침은 “회사”가 제공하는 “어플리케이션 (뛰장)” (이하 어플리케이션을 ‘서비스’이라 합니다.)이용에 적용되며 다음과 같은 내용을 담고 있습니다.
            </p>
            <ul class="tab_cont_list">
              <li>
                <p class="tab_cont_tit">
                  제1조 수집하는 개인 민감정보의 항목
                  “회사”는 회원가입, 원활한 고객상담, 각종 서비스의 제공을 위해 아래와 같은 최소한의 개인 민감정보를 필수항목으로 수집하고 있습니다.
                  “회사”는 귀하의 개인 민감정보보호를 매우 중요시하며, 『개인 민감정보 보호법』과 『정보통신망 이용촉진 및 정보보호 등에 관한법률』상의 개인 민감정보 처리방침 및 행정안전부와 정보통신부가
                  제정한 『개인 민감정보 보호지침』을 준수하고 있습니다. “회사”는 개인 민감정보처리방침을 통하여 귀하께서 제공하시는 개인 민감정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인
                  민감정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다. “회사”는 개인 민감정보 처리방침을 홈페이지 첫 화면과 서비스 내 고객센터의 ‘개인 민감정보(건강정보) 처리방침’ 항목에서
                  공개함으로써 이용자들이 언제나 용이하게 보실 수 있도록 조치하고 있습니다. “회사”는 개인 민감정보 처리방침의 지속적인 개선을 위하여 개인 민감정보 처리방침을 개정하는데 필요한 절차를
                  정하고 있습니다. 그리고 개인 민감정보 처리방침을 개정하는 경우 버전번호 등을 부여하여 개정된 사항을 귀하께서 쉽게 알아볼 수 있도록 하고 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제2조 개인 민감정보의 수집 및 이용 목적
                  “회사”는 이용자의 동의가 있거나 법령의 규정에 의한 경우를 제외하고는 본 조에서 고지한 범위를 넘어 이용자의 개인정보를 이용하지 않습니다. 수집한 개인정보의 이용 목적은 아래와
                  같습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  <br>1. 회원 관리: 개인 식별, 불량 회원의 부정 이용 방지와 비인가 사용 방지,분쟁 조정을 위한 기록보존, 연령확인, 불만처리 등 민원 상담 처리, 고지사항 등 최신 정보 전달
                  <br>2. 서비스 제공에 관한 계약 이행 및 요금정산 : 비대면 진료 예약, 서비스 요금 결제, 약배달 서비스 신청, 콘텐츠 제공, 물품 배달 또는 청구서 등 발송, 금융거래 본인 인증
                  및 금융 서비스, 요금추심 등 각종 계약체결 및 이행에 필요한 사항
                  <br>3. 맞춤형 회원 서비스 개발: 신규 서비스(제품) 개발 및 특화, 이벤트 등 광고성 정보 개선, 만족도 조사, 인구 통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속 빈도
                  파악 또는 이용자의 서비스 이용에 대한 통계 추출, 결제유형 별 할인혜택 서비스 개발 및 제공
                  <br>4. 통계작성, 과학적 연구, 공익적 기록보존 등을 위한 가명정보 처리
                  <br>5. 마케팅 및 광고 제공(마케팅 정보 수신 동의 시):뛰장 광고, 서비스 안내, 혜택 제공, 쿠폰 제공 안내
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제3조 개인 민감정보 수집 및 이용에 대한 동의
                  “회사”는 이용자들이 “회사”의 개인 민감정보 보호정책 또는 이용약관의 내용에 대하여 「동의 합니다.」버튼을 클릭할 수 있는 절차를 마련하여, 「동의합니다.」버튼을 클릭하면 개인 민감정보
                  수집 및 이용에 대해 동의한 것으로 봅니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제4조 개인 민감정보의 처리 및 보유 기간
                  “회사”는 이용자가 회원자격을 유지하고 있는 동안 수집된 이용자의 개인정보를 보유·이용할 수 있으며, 이용자가 탈퇴하거나 자격을 상실할 경우에는 이용자의 별도 요청이 없더라도 수집된
                  회원정보를 삭제 및 파기합니다. 단, 이용자의 회원탈퇴 또는 회원자격 상실에도 불구하고 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존하며, 이용자의 처리정지, 삭제 요구권의
                  대상이 되지 아니합니다.
                  <br>1. “회사” 내부 방침에 의한 정보 보유
                  <br>2. 관계법령에 의한 정보 보유
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제5조 개인 민감정보의 제3자에 대한 제공
                  “회사”는 이용자의 개인정보를 제1조에서 고지한 범위 내에서 사용하며, 이용자의 사전 동의 없이는 동의 범위를 초과하여 이용하거나 원칙적으로 이용자의 개인정보를 외부에 공개하지 않습니다.
                  다만, 아래의 경우에는 예외로 합니다. - 이용자가 사전에 제3자 제공에 동의한 경우 - 서비스 제공에 따른 요금 정산을 위하여 필요한 경우 - 법령의 규정에 의하거나, 수사·조사
                  목적으로 법령에 정해진 절차와 방법에 따라 수사기관 및 감독당국의 요구가 있는 경우 - 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 알아볼 수 없는 형태로
                  가공하여 제공하는 경우 그 밖에 보다 나은 서비스 제공을 위하여 개인정보 제3자 제공이 필요한 경우, “회사”는 사전에 개인정보를 제공받는 자, 개인정보를 제공받는 자의 개인정보
                  이용목적, 제공하는 개인정보의 항목, 개인정보를 제공받는 자의 개인정보 보유 및 이용기간, 정보제공 동의를 거부할 권리가 있다는 사실 및 동의 거부 에 따른 불이익 등을 명시하여 이용자의
                  동의를 구합니다.
                  ① 정보를 제공받는 자 및 이용목적
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제6조 개인 민감정보 파기절차 및 방법
                  “회사”는 원칙적으로 개인 민감정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 관계법령에 따라 개인정보를 보존하여야 하는 경우에는 해당 기간 경과 후
                  지체없이 재생 불가능한 방법으로 파기하며, “회사”의 개인정보 파기절차 및 방법은 다음과 같습니다.
                  <br>① 개인 민감정보 파기절차 이용자가 입력한 정보는 수집 및 이용목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류함) 내부 규정 및 기타 관련 법령에 따라 일정기간
                  저장되거나 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의해 허용된 경우가 아니고서는 다른 목적으로 이용되지 않습니다.
                  <br>② 개인 민감정보 파기기한 개인정보의 보유기간이 경과한 경우에는 그 경과한 날로부터, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 된
                  경우에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 각 지체 없이(정당한 사유가 없는 한 영업일 기준 5일 이내) 해당 개인정보를 파기합니다.
                  <br>③ 개인 민감정보 파기방법 전자적 파일 형태의 정보는 로우레벨포맷, 와이핑 방법 등 복구 및 재생이 되지 않는 기술적인 방법을 사용합니다. 종이에 출력된 개인정보는 분쇄기로
                  분쇄하거나 소각을 통하여 파기합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제7조 이용자의 권리와 의무 및 그 행사방법
                  <br>1. 이용자는 언제든지 등록되어 있는 이용자의 개인정보를 열람하거나 수정할 수 있으며, 자신의 개인 민감정보에 대한 열람을 요청할 수 있습니다.
                  <br>2. 이용자는 언제든지 개인 민감정보 처리의 정지를 요청할 수 있으며, 법률에 특별한 규정이 있는 등의 경우에는 처리정지 요청을 거부할 수 있습니다.
                  <br>3. 이용자는 언제든지 '회원 탈퇴하기' 화면을 통해 개인 민감정보의 수집 및 이용 동의를 철회할 수 있습니다.
                  <br>4. 이용자가 개인 민감정보의 오류에 대한 정정을 요청한 경우, 정정을 완료하기 전까지 해당 개인 민감정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인 민감정보를 제3자에게
                  이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.
                  <br>5. “회사”는 이용자의 요청에 의해 해지 또는 삭제된 개인 민감정보는 제3조에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.
                  <br>6. 이용자의 권리는 '설정' 화면에서 직접 처리가 가능합니다. 다만, 직접 처리가 불가능한 건은 개인정보 보호 업무 담당부서에게 서면, 전화 또는 이메일로 요청하시면 관계법령에
                  따른 기간 내 권리행사 방법 또는 그 결과를 통지하겠습니다.
                  <br>7. 만 14세 이상인 경우에만 회원 가입이 가능하며, “회사”는 개인 민감정보의 수집·이용에 법정 대리인의 동의가 필요한 만 14세 미만 아동의 개인정보는 원칙적으로 수집하지
                  않습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제8조 개인 민감정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항 (쿠키의 활용)
                  “회사”는 이용자의 정보를 수시로 저장하고 찾아내는 “쿠키” 등을 운용 합니다. “쿠키”란 “회사”의 서비스를 운영하는데 이용되는 서버가 웹 브라우저에 보내는 아주 작은 텍스트 파일로서
                  이용자가 이용한 단말기에 저장됩니다. 그러나 이 정보는 반드시 이용자가 정보를 제공하였을 때만 저장되고, 서비스는 이용자가 제공하지 않은 정보를 얻을 수 없으며, 기기에 저장되어 있는
                  다른 파일에 접근할 수 없습니다. “쿠키”의 사용 목적 및 “쿠키” 설정 거부 방법은 다음과 같습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  <br>1. 사용 목적 이용자의 접속 빈도나 방문 시간 등을 분석, 이용자의 취향과 관심분야를 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 회수 파악 등을 통한 타겟 마케팅 및
                  개인 맞춤 서비스를 제공하기 위해 사용합니다.
                  <br>2. 설정 거부 방법 1. 이용자는 “쿠키” 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹 브라우저에서 옵션을 설정함으로써 모든 “쿠키”를 허용하거나, “쿠키”가
                  저장될 때마다 확인을 거치거나, 아니면 모든 “쿠키”의 저장을 거부할 수도 있습니다. 단, 이용자가 “쿠키” 설치를 거부하였을 경우 로그인이 필요한 일부 서비스 제공에 어려움이 있을 수
                  있습니다. 2. “쿠키” 설치 허용 여부를 설정하는 방법은 다음과 같습니다. 가. Internet Explorer : 도구 > 인터넷 옵션 > 개인정보 나. Google Chrome :
                  설정 > 고급 설정 > 개인정보
                  <br>3. 서비스 이용 시 광고 식별자 수집 “회사”는 이용자의 ADID/IDFA를 수집할 수 있습니다. ADID/IDFA란 서비스 이용자의 광고 식별 값으로서, 이용자의 맞춤 서비스
                  제공이나 더 나은 환경의 광고를 제공하기 위한 측정을 위해 수집할 수 있습니다. 1. 거부 방법 가. Android : 설정 > 구글(구글설정) > 광고 > 광고 맞춤설정 선택 해제 나.
                  iOS : 설정 > 개인정보 보호 > 광고 > 광고 추적 제한
                  <br>4. 온라인 맞춤형 광고 서비스 “회사”는 다음과 같이 온라인 맞춤형 광고 사업자가 광고식별자 및 행태정보를 수집하도록 허용하고 있습니다. 1. 행태정보를 수집 및 처리하는 광고
                  사업자 : Google 2. 행태정보 수집 방법 : 이용자가 당사 앱을 실행할 때 자동 수집 및 전송
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제9조 개인 민감정보의 안전성 확보조치
                  “회사”는 개인정보 보호법에 따라 다음과 같이 안전성 확보에 필요한 기술적·관리적 및 물리적 조치를 하고 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  <br>1. 정기적인 자체 감사 실시 개인정보 취급 관련 안정성 확보를 위해 정기적으로 자체 감사를 실시하고 있습니다.
                  <br>2. 개인정보 취급 직원의 최소화 및 교육 개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고 있습니다.
                  <br>3. 내부관리계획의 수립 및 시행 개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.
                  <br>4. 해킹 등에 대비한 기술적 대책 “회사”는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터
                  접근이 통제된 구역에 시스템을 설치하고 기술적·물리적으로 감시 및 차단하고 있습니다.
                  <br>5. 개인정보의 암호화 이용자의 개인정보는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을
                  사용하는 등의 별도 보안기능을 사용하고 있습니다.
                  <br>6. 접속기록의 보관 및 위변조 방지 개인정보처리시스템에 접속한 기록을 관계법령에서 요구하는 기간동안 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록
                  보안기능을 사용하고 있습니다.
                  <br>7. 개인정보처리시스템 접근 제한 개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며
                  침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
                  <br>8. 문서보안을 위한 잠금장치 사용 개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고 있습니다.
                  <br>9. 비인가자에 대한 출입 통제 개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제10조 개인 민감정보 처리의 위탁
                  “회사”는 서비스를 위해 반드시 필요한 개인 민감정보의 처리 업무 중 일부를 외부 업체에게 위탁하여 수행하고 있으며, 위탁받은 업체(수탁자)가 개인정보 관련 법률에 따라 개인정보를
                  안전하게 취급하도록 위탁업무 수행목적 외 개인정보 처리 금지, 기술적•관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리•감독, 손해배상 등 책임에 관한 사항을 “개인정보 처리 위탁
                  계약서” 등을 통해 규정하고 있습니다. 서비스 제공 계약 이행과 이용자의 편의증진 등을 위해 개인정보의 처리 위탁이 필요한 경우, 정보통신망법 제25조 제2항에 따라 본 개인정보처리방침의
                  공개로 위탁동의를 갈음하며, 이와 관련한 처리위탁업무의 내용이나 수탁자가 변경될 경우, “회사”는 지체 없이 본 개인정보처리방침을 통하여 공개합니다. “회사”는 서비스 제공 계약 이행과
                  회원 편의 증진을 위해 아래와 같은 업무를 외부 업체에 위탁하고 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  ① 개인 민감정보의 처리를 위탁하는 경우
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  시행일자: 2023년 07월 10일
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  ② 개인 민감정보의 처리를 국외 이전하여 위탁하는 경우
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  시행일자: 2023년 07월 10일
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제11조 개인 민감정보 보호책임자 및 담당부서
                  “회사”는 이용자의 개인 민감정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 관련 부서 및 개인 민감정보 보호책임자를 지정하고 있습니다. 이용자는 “회사”의 서비스를
                  이용할때 발생하는 모든 개인정보 보호 관련 민원을 개인정보 관리책임자 혹은 담당부서로 신고할 수 있습니다. “회사”는 이용자의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다. -
                  개인 민감정보보호 책임자: 오형래 - 소속: 뛰장 - 전화번호: 010-4047-0017 - 전자우편: waro1004@naver.com 기타 개인정보 침해에 대한 신고나 상담이
                  필요한 경우에 아래 기관에 문의 가능합니다. - 개인정보침해신고센터(https://privacy.kisa.or.kr / 국번없이 118) - 대검찰청
                  사이버수사과(https://www.spo.go.kr / 국번없이 1301) - 경찰청 사이버안전국(https://cyberbureau.police.go.kr / 국번없이 182)
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제12조 개인 민감정보처리방침의 개정 및 고지
                  본 개인정보처리방침 개정 시에는 서비스를 통해 사전 고지합니다. 단, 제공, 위탁 또는 국외이전에 대한 변경의 경우는 고지 즉시 개정될 것입니다. 현재 효력을 발생하는 본 방침의
                  공고일자와 시행일자, 이전 개인 민감정보처리방침은 아래와 같습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  공고일자 : 2023년 07월 10일
                  시행일자 : 2023년 07월 10일
                </p>
              </li>
            </ul>
          </div>
          <!-- <textarea class="nft" v-show="termsShow.show3" v-model="terms3" /> -->
          <el-checkbox v-model="form.terms4">위치정보 이용약관 (필수)
            <el-button type="text" @click="handleShowTerms('show4')">내용보기</el-button></el-checkbox>
          <div class="guide" v-show="termsShow.show4">
            <p class="tab_cont_tit mb_tit">
              <span class="fw_b">위치정보 이용약관</span><br>
              제1조 (목적)
              본 약관은 회원(본 약관에 동의한 자를 말합니다. 이하 “회원”이라고 합니다)이 주식회사 뛰장(이하 “회사”라고 합니다)가 제공하는 위치정보서비스 및 위치기반서비스(이하 “서비스”라고
              합니다)를 이용함에 있어 회사와 회원의 권리•의무 및 책임사항을 규정함을 목적으로 합니다.
            </p>
            <ul class="tab_cont_list">
              <li>
                <p class="tab_cont_tit">
                  제2조 (약관의 효력 및 변경)
                  본 약관은 서비스를 신청한 고객 또는 개인위치정보주체가 본 약관에 동의하고 회사가 정한 소정의 절차에 따라 서비스의 이용자로 등록함으로써 효력이 발생합니다.
                  회사는 본 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 초기 화면에 게시하거나 기타의 방법으로 공지합니다.
                  회사는 필요하다고 인정되면 본 약관을 변경할 수 있으며, 회사가 약관을 개정할 경우에는 기존약관과 개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그 적용일자 7일
                  전부터
                  적용일 이후 상당한 기간 동안 공지합니다. 다만, 개정 내용이 회원에게 불리한 경우에는 그 적용일자 30일 전부터 적용일 이후 상당한 기간 동안 각각 이를 서비스 홈페이지에 게시하거나
                  회원에게
                  전자적 형태(전자우편, SMS 등)로 약관 개정 사실을 발송하여 고지합니다.
                  회사가 전항에 따라 회원에게 공지하거나 통지하면서 공지 또는 통지ㆍ고지일로부터 개정약관 시행일 7일 후까지 거부의사를 표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도
                  불구하고
                  거부의 의사표시가 없는 경우에는 변경된 약관에 승인한 것으로 봅니다. 회원이 개정약관에 동의하지 않을 경우 회원은 이용계약을 해지할 수 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제3조 (약관 외 준칙)
                  본 약관에 규정되지 않은 사항에 대해서는 위치정보의 보호 및 이용 등에 관한 법률(이하 “위치정보법”이라고 합니다), 전기통신사업법, 정보통신망 이용촉진 및 보호 등에 관한 법률(이하
                  “정보통신망법”이라고 합니다), 개인정보보호법 등 관련법령 또는 회사가 정한 서비스의 운영정책 및 규칙 등(이하 “세부지침”이라고 합니다)의 규정에 따르며, 개인정보 처리기준 및 보호조치
                  등에
                  관한 사항은 개인정보 처리방침을 통해 공개합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제4조 (서비스의 가입)
                  회사는 아래와 같은 경우에는 이용자의 가입신청을 승낙하지 않을 수 있습니다.
                  실명이 아니거나 다른 사람의 명의를 사용하는 등 허위로 신청하는 경우
                  회원 등록 사항을 빠뜨리거나 잘못 기재하여 신청하는 경우
                  기타 회사가 정한 이용신청 요건을 충족하지 않았을 경우
                  제5조 (서비스의 해지)
                  회원이 서비스 이용을 해지하고자 할 경우 회원은 회사가 정한 절차(서비스 홈페이지 등을 통해 공지합니다)를 통해 서비스 해지를 신청할 수 있으며, 회사는 법령이 정하는 바에 따라 신속히
                  처리합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제6조 (서비스의 내용)
                  서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 단, 회사의 업무 또는 기술상의 이유로 서비스가 일시 중지될 수 있으며, 운영상의 목적으로 회사가 정한 기간에도 서비스는 일시
                  중지될
                  수 있습니다. 이때 회사는 사전 또는 사후에 이를 공지합니다.
                  회사가 제공하는 서비스의 종류, 세부 내용은 ‘별표1. 서비스의 종류’에 따릅니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제7조 (서비스 이용요금)
                  회사가 제공하는 서비스는 기본적으로 무료입니다. 회사가 별도의 유료서비스를 제공하는 경우에는 해당 서비스에서 요금을 명시합니다.
                  회사는 유료서비스 이용요금을 회사와 계약한 전자지불업체에서 정한 방법에 의하거나 회사가 정한 청구서에 합산하여 청구할 수 있습니다.
                  유료서비스 이용을 통하여 결제된 대금에 대한 취소 및 환불은 회사의 결제 이용약관 등 관련법령에 따릅니다.
                  회원의 개인정보도용 및 결제사기로 인한 환불요청 또는 결제자의 개인정보 요구는 법률이 정한 경우 외에는 거절될 수 있습니다.
                  무선서비스 이용 시 발생하는 데이터 통신료는 별도이며, 회원이 가입한 각 이동통신사의 정책에 따릅니다.
                  MMS 등으로 게시물을 등록할 경우 발생하는 요금은 회원이 가입한 각 이동통신사의 정책에 따릅니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제8조 (서비스의 이용제한 및 중지)
                  회사는 아래 각 호의 경우에는 회원의 서비스 이용을 제한하거나 중지시킬 수 있습니다.
                  회원이 회사 서비스의 운영을 고의 또는 중과실로 방해하는 경우
                  서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우
                  전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
                  국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때
                  기타 중대한 사유로 인하여 회사가 서비스 제공을 지속하는 것이 부적당하다고 인정하는 경우
                  회사는 전항의 규정에 의하여 서비스의 이용을 제한하거나 중지한 때에는 그 사유 및 제한기간 등을 회원에게 알려야 합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제9조 (서비스내용변경 통지 등)
                  회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 전자적 형태(전자우편, SMS 등)의 방법을 통하여 서비스 내용의 변경 사항 또는 종료를 통지할 수 있습니다.
                  전항의 경우 불특정 다수인을 상대로 통지를 함에 있어서는 서비스 홈페이지 등 기타 회사의 공지사항 페이지를 통하여 회원들에게 통지할 수 있습니다. 단, 회원 본인의 거래와 관련하여 중대한
                  영향을
                  미치는 사항은 상당한 기간 동안 서비스 홈페이지에 게시하거나 회원에게 전자적 형태(전자우편, SMS 등)로 개별통지 합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제10조(위치정보의 수집 방법)
                  회사는 위치정보 및 위치기반서비스를 제공하기 위하여 회원의 개인위치정보를 수집하며, 회원은 본 약관에 동의함으로써 이에 동의한 것으로 간주됩니다. 서비스 탈퇴 등의 방법을 통하여
                  개인위치정보의
                  수집에 관한 동의를 철회할 수 있습니다.
                  회사는 다음과 같은 방식으로 개인위치정보를 수집하여, 회원에게 제6조 제2항의 서비스를 제공합니다.
                  차량 등에 장착된 GPS 단말기를 이용하여 위치 정보를 수집함
                  제2항에 따른 위치정보의 수집방법이 변경되는 경우 회사는 미리 홈페이지 등에 공지하거나 회원에게 별도 통지합니다. 다만 통제할 수 없는 사유가 발생하여 사전 통지가 불가능한 경우 사후
                  통지합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제11조 (개인위치정보의 이용 또는 제공)
                  회사는 개인위치정보를 이용하여 서비스를 제공하고자 하는 경우에는 미리 약관에 명시한 후 개인위치정보주체의 동의를 얻어야 합니다.
                  회사는 제3자에게 개인위치정보를 제공하는 경우에는, 제공 받는자 및 제공목적을 사전에 개인위치정보주체에게 고지하고 동의를 받습니다. 다만, 다음의 경우는 예외로 하고 있습니다.
                  법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우
                  회사는 개인위치정보를 회원이 지정하는 제3자에게 제공하는 경우에는 개인위치정보를 수집한 당해 통신 단말장치로 매회 회원에게 제공받는 자, 제공 일시 및 제공목적을 즉시 통보합니다. 단,
                  아래 각
                  호의 1에 해당하는 경우에는 회원이 미리 특정하여 지정한 통신 단말장치 또는 전자우편주소로 통보합니다.
                  개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우
                  회원이 온라인 게시 등의 방법으로 통보할 것을 미리 요청한 경우
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제12조 (개인위치정보의 보유목적 및 보유기간)
                  회사는 위치정보 및 위치기반서비스를 제공하기 위해 필요한 최소한의 개인위치정보를 보유 및 이용하며, 개인위치정보의 보유목적은 ‘별표1. 서비스의 종류’에 따릅니다.
                  회사는 회원의 개인위치정보를 이용한 경우 위치정보법에 의하여 기록·보존하여야 하는 위치정보 이용·제공사실 확인자료 및 해당 개인위치정보를 회원 탈퇴 및 서비스 종료 시 지체 없이
                  파기합니다.
                  단, 관련 법령에 의한 보관이 필요한 경우 해당 기간만큼 보관합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제13조 (위치정보 수집·이용·제공사실 확인자료의 보유)
                  회사는 위치정보법 제16조 제2항에 근거하여 다른 사업자 또는 이용 고객과 요금정산 및 민원처리를 위해 위치정보 수집, 이용, 제공사실 확인자료를 위치정보시스템에 자동으로 기록하며, 해당
                  자료는
                  최소 6개월간 보존합니다.
                  회사는 위치정보법 제24조 제4항에 따라 개인위치정보주체가 수집, 이용, 제공 동의의 전부 또는 일부를 철회한 경우 회사는 수집한 개인위치정보 및 수집ㆍ이용ㆍ제공사실 확인자료(동의의
                  일부를
                  철회하는 경우에는 철회하는 부분의 개인위치정보 및 위치정보 이용ㆍ제공사실 확인자료에 한합니다.)를 즉시 파기합니다 . 단, 관련 법령의 규정에 따라 보존할 필요가 있을 때에는 해당
                  법령에서 정한
                  바에 따라 보존합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제14조 (개인위치정보주체의 권리)
                  회원은 회사에 대하여 언제든지 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의의 전부 또는 일부를 철회할 수 있습니다.
                  회원은 회사에 대하여 언제든지 개인위치정보의 수집, 이용 또는 제공의 일시적인 중지를 요구할 수 있으며, 회사는 이를 거절할 수 없고 이를 위한 기술적 수단을 갖추고 있습니다.
                  회원은 회사에 대하여 아래 각 호의 자료에 대한 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그 정정을 요구할 수 있습니다. 이 경우 회사는 정당한 사유 없이
                  회원의
                  요구를 거절할 수 없습니다.
                  본인에 대한 위치정보 수집, 이용, 제공사실 확인자료
                  본인의 개인위치정보가 위치정보의 보호 및 이용 등에 관한 법률 또는 다른 법률 규정에 의하여 제3자에게 제공된 이유 및 내용
                  회원은 회사에서 정한 소정의 절차를 통해 제1항 내지 제3항의 내용을 요구할 수 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제15조 (법정대리인의 권리)
                  회사는 14세 미만의 회원에 대해서는 개인위치정보의 수집 및 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의를 당해 회원과 당해 회원의
                  법정대리인으로부터
                  받아야 합니다. 이 경우 법정대리인은 제14조에 의한 회원의 권리를 모두 가집니다.
                  회사는 14세 미만의 아동의 개인위치정보 또는 위치정보 이용, 제공사실 확인자료를 이용약관에 명시 또는 고지한 범위를 넘어 이용하거나 제3자에게 제공하고자 하는 경우에는 14세 미만의
                  아동과 그
                  법정대리인의 동의를 받아야 합니다. 단, 아래의 경우는 제외합니다.
                  위치정보 및 위치기반서비스 제공에 따른 요금정산을 위하여 위치정보 이용, 제공사실 확인자료가 필요한 경우
                  통계작성, 학술연구 또는 시장조사를 위하여 특정 개인을 알아볼 수 없는 형태로 가공하여 제공하는 경우
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제16조 (8세 이하의 아동 등의 보호의무자의 권리)
                  회사는 아래의 경우에 해당하는 자(이하 “8세 이하의 아동 등”이라고 합니다)의 보호의무자가 8세 이하의 아동 등의 생명 또는 신체보호를 위하여 개인위치정보의 수집, 이용 또는 제공에
                  동의하는
                  경우에는 본인의 동의가 있는 것으로 봅니다.
                  8세 이하의 아동
                  피성년후견인
                  장애인복지법 제2조 제2항 제2호의 규정에 따른 정신적 장애를 가진 자로서 장애인 고용촉진 및 직업재활법 제2조 제2호의 규정에 따라 중증장애인에 해당하는 자(장애인복지법 제32조의
                  규정에 따라
                  장애인등록을 한 자에 한합니다)
                  전항의 규정에 따른 8세 이하 아동 등의 보호의무자는 해당 아동을 사실상 보호하는 자로서 다음 각 호에 해당하는 자를 말합니다.
                  8세 이하의 아동의 법정대리인 또는 보호시설에 있는 미성년자의 후견 직무에 관한 법률 제3조의 규정에 따른 후견인
                  피성년후견인의 법정대리인
                  본 조 제1항 제3호의 자의 법정대리인 또는 장애인복지법 제58조 제1항 제1호의 규정에 따른 장애인생활시설(국가 또는 지방자치단체가 설치·운영하는 시설에 한합니다)의 장, 정신보건법
                  제3조
                  제4호의 규정에 따른 정신질환자 사회복귀시설(국가 또는 지방자치단체가 설치·운영하는 시설에 한합니다)의 장, 동법 동조 제5호의 규정에 따른 정신요양시설의 장
                  8세 이하의 아동 등의 생명 또는 신체의 보호를 위하여 개인위치정보의 수집, 이용 또는 제공에 동의를 하고자 하는 보호의무자는 서면동의서에 보호의무자임을 증명하는 서면을 첨부하여 회사에
                  제출하여야 합니다.
                  보호의무자는 8세 이하의 아동 등의 개인위치정보 수집, 이용 또는 제공에 동의하는 경우 개인위치정보주체 권리의 전부를 행사할 수 있습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제17조 (회사의 주소 및 연락처 등)
                  회사의 상호, 주소 및 연락처는 아래와 같습니다.
                  상호 : (주)뛰장
                  대표 : 오형래
                  주소 : 경기도 성남시 분당구 판교역로 152, 13층(백현동, 알파돔타워)
                  대표전화 : 010-4047-0017
                  회사는 개인위치정보를 적절히 관리·보호하고, 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보관리책임자로 지정해 운영하고 있으며,
                  위치정보관리책임자의 성명과 연락처는 아래와 같습니다.
                  위치정보 관리책임자 : 오형래
                  대표전화 : 010-4047-0017
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제18조 (양도금지)
                  회원의 서비스 받을 권리는 이를 양도 내지 증여하거나 담보제공 등의 목적으로 처분할 수 없습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제19조 (손해배상)
                  회사가 위치정보법 제15조 내지 제26조의 규정을 위반한 행위로 회원에게 손해가 발생한 경우 회원은 회사에 대하여 손해배상 청구를 할 수 있습니다. 이 경우 회사는 고의, 과실이 없음을
                  입증하지
                  못하는 경우 책임을 면할 수 없습니다.
                  회원이 본 약관의 규정을 위반하여 회사에 손해가 발생한 경우 회사는 회원에 대하여 손해배상을 청구할 수 있습니다. 이 경우 회원은 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할
                  수
                  없습니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제20조 (면책)
                  회사는 다음 각 호의 사유로 서비스를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.
                  천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우
                  서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의 고의적인 서비스 방해가 있는 경우
                  회원의 귀책사유로 서비스 이용에 장애가 있는 경우
                  제1호 내지 제3호를 제외한 기타 회사의 고의ㆍ과실이 없는 사유로 인한 경우
                  회사는 서비스 및 서비스에 게재된 정보, 자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 회원의 손해에 대하여는 책임을 부담하지 아니합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제21조(준거법 및 재판관할)
                  본 약관은 대한민국법령에 의하여 규정되고 이행 됩니다.
                  회원 및 법정대리인의 권리와 그 행사방법은 제소 당시의 이용자의 주소에 의하며, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 이용자의 주소 또는
                  거소가
                  분명하지 않거나 외국 거주자의 경 우에는 민사소송법상의 관할법원에 제기합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제22조 (분쟁의 조정 및 기타)
                  서비스 이용과 관련하여 회사와 회원 간에 분쟁이 발생하면, 회사는 분쟁의 해결을 위해 회원과 성실히 협의합니다.
                  전항의 협의에서 분쟁이 해결되지 않은 경우 회사와 회원은 위치정보법 제28조에 의한 방송통신위원회에 재정을 신청하거나, 개인정보보호법 제43조에 의한 방송통신위원회 또는
                  개인정보분쟁조정위원회에
                  재정 또는 분쟁조정을 신청할 수 있습니다.
                  전항으로도 분쟁이 해결되지 않으면 회사와 회원 양 당사자는 민사소송법상의 관할법원에 소를 제기할 수 있습니다.
                  부칙
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  제1조 (시행일) 본 약관은 2023년 06월 01일부터 시행합니다.
                </p>
              </li>
            </ul>
          </div>
          <!-- <textarea class="nft" v-show="termsShow.show4" v-model="terms4" /> -->
          <el-checkbox v-model="form.marketingStatus">마케팅 정보수신 (선택)
            <el-button type="text" @click="handleShowTerms('show5')">내용보기</el-button></el-checkbox>
          <div class="guide" v-show="termsShow.show5">
            <p class="tab_cont_tit mb_tit">
              <span class="fw_b">마케팅정보 수신동의</span><br>
              개인정보보호법 제22조 제4항에 의해 선택정보 사항에 대해서는 기재하지 않으셔도 서비스를 이용하실 수 있습니다.
            </p>
            <ul class="tab_cont_list">
              <li>
                <p class="tab_cont_tit">
                  1. 마케팅 및 광고에의 활용신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 인구통계학적 특성에 따른 서비스
                  제공 및 광고 게재, 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.
                </p>
              </li>
              <li>
                <p class="tab_cont_tit">
                  2. 센드비는 서비스를 운용함에 있어 각종 정보를 서비스 화면, 전화, e-mail, SMS, 우편물, 앱푸시 등의 방법으로 센드비 회원에게 제공할 수
                  있으며, 센드비 모바일 쿠폰의 수신 등, 의무적으로 안내되어야 하는 정보성 내용은 수신동의 여부와 무관하게 제공됩니다.
                </p>
              </li>
            </ul>
          </div>
          <!-- <textarea class="nft" v-show="termsShow.show5" v-model="terms5" /> -->
          <div class="button-color__gray">
            <input v-model="allTerms" type="checkbox" id="Allcheck" @click="handleAllTermCheck">
            <label for="Allcheck">모든 약관에 전체 동의합니다.</label>
          </div>
        </div>
        <div class="step2-bot">
          <div class="button-color__blue">
            <button @click="handleAgree()" class="agree">동의하기</button>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { Vue, Component, Watch } from 'vue-property-decorator';
import { JoinModule } from '@/store/join';
import { defaultJoinForm } from '@/api/user';
import { UserModule } from '@/store/modules/user';
import { getJwtInfo } from '@/utils/cookies';

@Component({
  name: 'joinStep',
  components: {
  },
})

export default class extends Vue {
  @Watch('form.terms1')
  private handleChangeTerms1() {
    this.handleCheckAllTerms();
  }

  @Watch('form.terms2')
  private handleChangeTerms2() {
    this.handleCheckAllTerms();
  }

  @Watch('form.terms3')
  private handleChangeTerms3() {
    this.handleCheckAllTerms();
  }

  @Watch('form.terms4')
  private handleChangeTerms4() {
    this.handleCheckAllTerms();
  }

  @Watch('form.marketingStatus')
  private handleChangeMarketingStatus() {
    this.handleCheckAllTerms();
  }

  mounted() {
    this.checkSocialUser();
  }

  get form() {
    return JoinModule.form;
  }

  private termsShow: any = {
    show1: false,
    show2: false,
    show3: false,
    show4: false,
    show5: false,
  }

  private handleShowTerms(item: any) {
    this.termsShow[item] = !this.termsShow[item];
  }

  private allTerms = false;

  private handleAllTermCheck() {
    this.allTerms = !this.allTerms;
    this.form.terms1 = this.allTerms;
    this.form.terms2 = this.allTerms;
    this.form.terms3 = this.allTerms;
    this.form.terms4 = this.allTerms;
    this.form.marketingStatus = this.allTerms;
  }

  private terms1 = '';

  private terms2 = '';

  private terms3 = '';

  private terms4 = '';

  private terms5 = '';

  private handleAgree() {
    if (this.form.terms1 && this.form.terms2 && this.form.terms3 && this.form.terms4) {
      this.form.step = 2;
      this.$router.push({ name: 'Signup' }).catch((error) => console.log(error));
    } else {
      this.$message.warning('필수 약관동의를 해주세요.');
    }
  }

  private handleCheckAllTerms() {
    if (this.form.terms1 && this.form.terms2 && this.form.terms3 && this.form.terms4 && this.form.macketingStatus) {
      this.allTerms = true;
    } else {
      this.allTerms = false;
    }
  }

  private checkSocialUser() {
    const token = UserModule.token;
    if (token) {
      const status = getJwtInfo('status');
      if (status) {
        this.$router.push({ name: 'Home' });
      } else {
        JoinModule.setForm(defaultJoinForm());
      }
    } else {
      this.$router.push({ name: 'Login' });
    }
  }
}
</script>

<style>.guide {
  height: 200px;
  overflow-y: scroll;
  border: #666 solid 1px;
  font-size: 15px;
  padding: 15px;
}

.fw_b {
  font-weight: bold;
}

.tab_cont_tit.mb_tit {
  color: #666;
  margin-bottom: 0.5em;
  font-weight: normal;
}

.tab_cont_list>li {
  margin-bottom: 1.5em;
}

.tab_cont_tit {
  color: #666;
  line-height: 1.6em;
  text-align: left;
  word-break: keep-all;
}</style>
